<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"3bfa3704e6d561c5a2856f9ec7dd31f368e555d988023ee1921ceeb0a3b3f7a6","plan_job_ref":"Job Terraform plan #12 at https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124145738","plan_hash":"737e981e68540cb6dc8164c1691b46e7fafb897aff3a26d92f9669a29c259d01","plan_text_format":"diff","version":"1.42.0","plan_out_hash":"a9286ce59c8172454af9f6910ee49f7ea91825bf90a3eef72535c9b5c1f221f0","closed":true} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
deployer_access_key = (sensitive value)
deployer_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # yandex_iam_service_account.sa_bucket will be created
+   resource "yandex_iam_service_account" "sa_bucket" {
+       created_at  = (known after apply)
+       description = "Service account to manage movie-recognizer"
+       folder_id   = (known after apply)
+       id          = (known after apply)
+       name        = "movie-recognizer-sa"
    }

  # yandex_iam_service_account_static_access_key.sa_key_bucket will be created
+   resource "yandex_iam_service_account_static_access_key" "sa_key_bucket" {
+       access_key           = (known after apply)
+       created_at           = (known after apply)
+       encrypted_secret_key = (known after apply)
+       id                   = (known after apply)
+       key_fingerprint      = (known after apply)
+       secret_key           = (sensitive value)
+       service_account_id   = (known after apply)
    }

  # yandex_storage_bucket.bucket will be created
+   resource "yandex_storage_bucket" "bucket" {
+       access_key            = (sensitive value)
+       bucket                = "movie-recognizer"
+       bucket_domain_name    = (known after apply)
+       default_storage_class = (known after apply)
+       folder_id             = (known after apply)
+       force_destroy         = false
+       id                    = (known after apply)
+       secret_key            = (sensitive value)
+       website_domain        = (known after apply)
+       website_endpoint      = (known after apply)

+       grant {
+           id          = (known after apply)
+           permissions = [
+               "READ",
+               "WRITE",
            ]
+           type        = "CanonicalUser"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform apply #2](https://github.com/LipatovAlexander/MovieRecognizer/actions/runs/8124155345)